Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties
The serialization structure for AnalysisModelOutputProperties.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputJointCoordinates
Indicates that the joint coordinates are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputMemberInformation
Indicates that the member information is created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputElementInformation
Indicates that the element information is created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputMemberProperties
Indicates that the member properties are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputMaterialProperties
Indicates that the material properties are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputSupportInformation
Indicates that the support information is created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputJointDisplacements
Indicates that the joint displacements re created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputMemberForces
Indicates that the member forces are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputAnalysisResults
Indicates that the analysis results are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputMemberSectionForces
Indicates that the member section forces are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputMemberStresses
Indicates that the member stresses are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputElementJointStresses
Indicates that the element joint stresses are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputElementForces
Indicates that the element forces are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputElementJointStressesSolid
Indicates that the element joint stresses solid is created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputModeShapes
Indicates that the mode shapes are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputSupportReactions
Indicates that the supported reactions are created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputEntireSteelTable
Indicates that the entire steel table is created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties._OutputStoryDrift
Indicates that the story drift is created.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties.ToStruct(Tekla.Structures.Analysis.AnalysisModelOutputProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties.FromStruct(Tekla.Structures.Analysis.AnalysisModelOutputProperties)
DO NOT USE! For internal usage only!
P: P.